# AnalyticalModelSurface Class (2022)

---
C#Visual BasicVisual C++
Revit 2022 API
---
AnalyticalModelSurface Class
Members See Also
---
An element that represents a surface in the structural analytical model.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class AnalyticalModelSurface : AnalyticalModel
```

Visual Basic
---
```text
Public Class AnalyticalModelSurface _
	Inherits AnalyticalModel
```

Visual C++
---
```text
public ref class AnalyticalModelSurface : public AnalyticalModel
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB.Structure..::..AnalyticalModel Autodesk.Revit.DB.Structure..::..AnalyticalModelSurface
# See Also
AnalyticalModelSurface Members
Autodesk.Revit.DB.Structure Namespace